-- i. Заполнить все таблицы БД vk данными (по 10-100 записей в каждой таблице)
-- ii. Написать скрипт, возвращающий список имен (только firstname) пользователей
-- без повторений в алфавитном порядке
use vk ;
SELECT DISTINCT firstname FROM users;

-- iii. Написать скрипт, отмечающий несовершеннолетних пользователей как неактивных
-- (поле is_active = false). Предварительно добавить такое поле в таблицу profiles 
-- со значением по умолчанию = true (или 1)
-- НЕ ПОНЯЛ КАК ДОБАВИТЬ ПОЛЕ is_active ОТМЕЧАЮЩЕЕ СОВЕРШЕНОЛЕТНИХ

ALTER TABLE profiles ADD COLUMN is_active VARCHAR(150) NOT NULL AFTER birthday;

SELECT user_id,birthday, CURDATE(),timestampdiff(YEAR ,birthday,CURDATE())
as age FROM profiles where YEAR (birthday )> 2001 ORDER BY age ;

-- mysql> SELECT user_id,birthday, CURDATE(),timestampdiff(YEAR ,birthday,CURDATE())
--     -> as age FROM profiles where YEAR (birthday )> 2001 ORDER BY age ;
-- +---------+------------+------------+------+
-- | user_id | birthday   | CURDATE()  | age  |
-- +---------+------------+------------+------+
-- |      88 | 2020-04-09 | 2020-05-03 |    0 |
-- |      36 | 2020-03-06 | 2020-05-03 |    0 |
-- |       2 | 2017-11-18 | 2020-05-03 |    2 |
-- |      73 | 2018-03-23 | 2020-05-03 |    2 |
-- |      31 | 2018-02-04 | 2020-05-03 |    2 |
-- |      28 | 2018-04-14 | 2020-05-03 |    2 |
-- 
-- |      46 | 2004-10-13 | 2020-05-03 |   15 |
-- |       4 | 2004-12-13 | 2020-05-03 |   15 |
-- |      11 | 2005-03-23 | 2020-05-03 |   15 |
-- |      75 | 2003-08-29 | 2020-05-03 |   16 |
-- |      93 | 2003-12-07 | 2020-05-03 |   16 |
-- |      76 | 2002-08-29 | 2020-05-03 |   17 |
-- |       1 | 2003-02-09 | 2020-05-03 |   17 |
-- +---------+------------+------------+------+


-- iv. Написать скрипт, удаляющий сообщения «из будущего» (дата больше сегодняшней)

DELETE FROM messages 
where created_at>CURDATE(); 


-- v. Написать название темы курсового проекта (в комментарии)
-- наверно кинопоиск -- 

